Проверка/DataProcessors/ТестыРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТестыРМК</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Проверка/Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаОплаты</Name>
							<Comment>Касса, на которую зачисляется оплата</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Проверка/DataProcessors/ТестыРМК/Forms/Форма/Ext/Form/Module.bsl
// Тесты РМК — standalone обработка тестирования без YAxUnit
// Версия: 1.0 — тесты КассовойСмены, ЧекаКММ, ВозвратаТовара

#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Результаты = "Нажмите ""Запустить тесты"" для начала тестирования.";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗапуститьТесты(Команда)
	Результаты = ЗапуститьТестыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗапуститьТестыНаСервере()

	Лог      = Новый Массив;
	Счётчик  = Новый Структура("Всего, Прошло, Упало", 0, 0, 0);

	Лог.Добавить("=== ТЕСТЫ РМК ===");
	Лог.Добавить("Запуск: " + Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy ЧЦ=2 ЧВ=2:"));
	Лог.Добавить("");

	Лог.Добавить("--- Тесты: Кассовая смена ---");
	ПровестиТестыКассовойСмены(Лог, Счётчик);

	Лог.Добавить("");
	Лог.Добавить("--- Тесты: Чек ККМ и Возврат ---");
	ПровестиТестыЧекаИВозврата(Лог, Счётчик);

	Лог.Добавить("");
	Лог.Добавить("==================");
	ПрефиксИтог = ?(Счётчик.Упало = 0, "УСПЕШНО", "ЕСТЬ ОШИБКИ");
	Лог.Добавить("ИТОГ [" + ПрефиксИтог + "]: Всего=" + Счётчик.Всего
		+ "  Прошло=" + Счётчик.Прошло + "  Упало=" + Счётчик.Упало);

	Возврат СтрСоединить(Лог, Символы.ПС);

КонецФункции

// ─── Вспомогательная функция утверждения ─────────────────────────────────

&НаСервереБезКонтекста
Процедура Утверждать(Условие, Описание, Лог, Счётчик)
	Счётчик.Всего = Счётчик.Всего + 1;
	Если Условие Тогда
		Счётчик.Прошло = Счётчик.Прошло + 1;
		Лог.Добавить("  OK: " + Описание);
	Иначе
		Счётчик.Упало = Счётчик.Упало + 1;
		Лог.Добавить("  FAILED: " + Описание);
	КонецЕсли;
КонецПроцедуры

// ─── Тесты Кассовой смены ─────────────────────────────────────────────────

&НаСервереБезКонтекста
Процедура ПровестиТестыКассовойСмены(Лог, Счётчик)

	НоваяСмена = Документы.КассоваяСмена.СоздатьДокумент();
	НоваяСмена.Дата         = ТекущаяДатаСеанса();
	НоваяСмена.ДатаНачала   = ТекущаяДатаСеанса();
	НоваяСмена.Статус       = Перечисления.СтатусыКассовойСмены.Открыта;

	// СМЕНА-1: запись документа
	Попытка
		НоваяСмена.Записать(РежимЗаписиДокумента.Запись);
		СменаСсылка = НоваяСмена.Ссылка;
		Утверждать(НЕ СменаСсылка.Пустая(),
			"СМЕНА-1: Создание документа КассоваяСмена", Лог, Счётчик);
	Исключение
		Утверждать(Ложь, "СМЕНА-1: Ошибка записи - " + ОписаниеОшибки(), Лог, Счётчик);
		Возврат;
	КонецПопытки;

	// СМЕНА-2: статус = Открыта
	Прочитана = СменаСсылка.ПолучитьОбъект();
	Утверждать(Прочитана.Статус = Перечисления.СтатусыКассовойСмены.Открыта,
		"СМЕНА-2: Статус после записи = Открыта", Лог, Счётчик);

	// СМЕНА-3: изменение статуса → Закрыта
	Прочитана.Статус       = Перечисления.СтатусыКассовойСмены.Закрыта;
	Прочитана.ДатаОкончания = ТекущаяДатаСеанса();
	Попытка
		Прочитана.Записать(РежимЗаписиДокумента.Запись);
		Утверждать(Прочитана.Статус = Перечисления.СтатусыКассовойСмены.Закрыта,
			"СМЕНА-3: Закрытие смены: Статус = Закрыта", Лог, Счётчик);
	Исключение
		Утверждать(Ложь, "СМЕНА-3: Ошибка закрытия - " + ОписаниеОшибки(), Лог, Счётчик);
	КонецПопытки;

	// Откат тестовых данных
	Попытка
		Прочитана.УстановитьПометкуУдаления(Истина);
	Исключение
	КонецПопытки;

КонецПроцедуры

// ─── Тесты Чека ККМ и Возврата ───────────────────────────────────────────

&НаСервереБезКонтекста
Процедура ПровестиТестыЧекаИВозврата(Лог, Счётчик)

	// Поиск необходимых справочников
	ЗапросКасса = Новый Запрос;
	ЗапросКасса.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Кассы.Ссылка КАК Ссылка
	|ИЗ Справочник.Кассы КАК Кассы
	|ГДЕ НЕ Кассы.ПометкаУдаления";
	РезКасса = ЗапросКасса.Выполнить();

	ЗапросТовар = Новый Запрос;
	ЗапросТовар.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Н.Ссылка КАК Ссылка
	|ИЗ Справочник.Номенклатура КАК Н
	|ГДЕ НЕ Н.ПометкаУдаления И НЕ Н.ЭтоГруппа";
	РезТовар = ЗапросТовар.Выполнить();

	ЗапросСклад = Новый Запрос;
	ЗапросСклад.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Склады.Ссылка КАК Ссылка
	|ИЗ Справочник.Склады КАК Склады
	|ГДЕ НЕ Склады.ПометкаУдаления";
	РезСклад = ЗапросСклад.Выполнить();

	Если РезКасса.Пустой() Тогда
		Лог.Добавить("  [ПРОПУСК] Нет ни одной кассы в базе — тесты чеков пропущены.");
		Возврат;
	КонецЕсли;
	Если РезТовар.Пустой() Тогда
		Лог.Добавить("  [ПРОПУСК] Нет номенклатуры в базе — тесты чеков пропущены.");
		Возврат;
	КонецЕсли;

	ВыбКасса  = РезКасса.Выгрузить()[0].Ссылка;
	ВыбТовар  = РезТовар.Выгрузить()[0].Ссылка;
	ВыбСклад  = ?(РезСклад.Пустой(), Справочники.Склады.ПустаяСсылка(), РезСклад.Выгрузить()[0].Ссылка);

	// ─── ЧЕК-1: создание документа ЧекККМ ────
	НовыйЧек = Документы.ЧекККМ.СоздатьДокумент();
	НовыйЧек.Дата           = ТекущаяДатаСеанса();
	НовыйЧек.Касса          = ВыбКасса;
	НовыйЧек.Склад          = ВыбСклад;
	НовыйЧек.Статус         = Перечисления.СтатусыЧекаККМ.НеФискальный;

	СтрТовар = НовыйЧек.Товары.Добавить();
	СтрТовар.Номенклатура = ВыбТовар;
	СтрТовар.Количество   = 2;
	СтрТовар.Цена         = 100;
	СтрТовар.Сумма        = СтрТовар.Количество * СтрТовар.Цена;

	СтрОплата = НовыйЧек.Оплата.Добавить();
	СтрОплата.ВидОплаты    = Перечисления.ВидыОплаты.Наличные;
	СтрОплата.КассаОплаты  = ВыбКасса;
	СтрОплата.Сумма        = СтрТовар.Сумма;

	НовыйЧек.СуммаДокумента = СтрТовар.Сумма;

	ЧекСсылка = Неопределено;
	Попытка
		НовыйЧек.Записать(РежимЗаписиДокумента.Запись);
		ЧекСсылка = НовыйЧек.Ссылка;
		Утверждать(НЕ ЧекСсылка.Пустая(),
			"ЧЕК-1: Создание документа ЧекККМ", Лог, Счётчик);
	Исключение
		Утверждать(Ложь, "ЧЕК-1: Ошибка - " + ОписаниеОшибки(), Лог, Счётчик);
		Возврат;
	КонецПопытки;

	// ─── ЧЕК-2: Сумма строки = 200 ────
	ПрочитанЧек = ЧекСсылка.ПолучитьОбъект();
	Утверждать(ПрочитанЧек.Товары[0].Сумма = 200,
		"ЧЕК-2: Сумма строки товара = 200 (факт: " + ПрочитанЧек.Товары[0].Сумма + ")", Лог, Счётчик);

	// ─── ЧЕК-3: СуммаДокумента = 200 ────
	Утверждать(ПрочитанЧек.СуммаДокумента = 200,
		"ЧЕК-3: СуммаДокумента = 200 (факт: " + ПрочитанЧек.СуммаДокумента + ")", Лог, Счётчик);

	// ─── ЧЕК-4: Статус = НеФискальный ────
	Утверждать(ПрочитанЧек.Статус = Перечисления.СтатусыЧекаККМ.НеФискальный,
		"ЧЕК-4: Статус = НеФискальный", Лог, Счётчик);

	// ─── ЧЕК-5: 1 строка в Товары ────
	Утверждать(ПрочитанЧек.Товары.Количество() = 1,
		"ЧЕК-5: Количество строк ТЧ Товары = 1", Лог, Счётчик);

	// ─── ЧЕК-6: 1 строка в Оплата ────
	Утверждать(ПрочитанЧек.Оплата.Количество() = 1,
		"ЧЕК-6: Количество строк ТЧ Оплата = 1", Лог, Счётчик);

	// ─── ВОЗВРАТ-1: создание ─────────────────
	НовыйВозврат = Документы.ВозвратТовараОтПокупателя.СоздатьДокумент();
	НовыйВозврат.Дата               = ТекущаяДатаСеанса();
	НовыйВозврат.ДокументОснование  = ЧекСсылка;
	НовыйВозврат.Склад              = ВыбСклад;
	НовыйВозврат.ФискальныйВозврат  = Ложь;

	Для Каждого СтрЧека Из ПрочитанЧек.Товары Цикл
		НоваяСтрВозврат = НовыйВозврат.Товары.Добавить();
		НоваяСтрВозврат.Номенклатура = СтрЧека.Номенклатура;
		НоваяСтрВозврат.Количество   = СтрЧека.Количество;
		НоваяСтрВозврат.Цена         = СтрЧека.Цена;
		НоваяСтрВозврат.Сумма        = СтрЧека.Сумма;
	КонецЦикла;

	Попытка
		НовыйВозврат.Записать(РежимЗаписиДокумента.Запись);
		Утверждать(НЕ НовыйВозврат.Ссылка.Пустая(),
			"ВОЗВРАТ-1: Создание документа ВозвратТовараОтПокупателя", Лог, Счётчик);
	Исключение
		Утверждать(Ложь, "ВОЗВРАТ-1: Ошибка - " + ОписаниеОшибки(), Лог, Счётчик);
	КонецПопытки;

	// ─── ВОЗВРАТ-2: ДокументОснование = чек ─
	Утверждать(НовыйВозврат.ДокументОснование = ЧекСсылка,
		"ВОЗВРАТ-2: ДокументОснование совпадает с чеком", Лог, Счётчик);

	// ─── ВОЗВРАТ-3: сумма возврата = сумма чека ─
	СуммаВозврата = 0;
	Для Каждого Стр Из НовыйВозврат.Товары Цикл
		СуммаВозврата = СуммаВозврата + Стр.Сумма;
	КонецЦикла;
	Утверждать(СуммаВозврата = ПрочитанЧек.СуммаДокумента,
		"ВОЗВРАТ-3: Сумма возврата = Сумме чека (" + ПрочитанЧек.СуммаДокумента + ")", Лог, Счётчик);

	// Откат тестовых данных
	Попытка
		НовыйВозврат.УстановитьПометкуУдаления(Истина);
	Исключение
	КонецПопытки;
	Попытка
		ПрочитанЧек.УстановитьПометкуУдаления(Истина);
	Исключение
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
